#### SurfaceNdfType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "SurfaceNdfType" from the "AdvancedLayered" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public enum SurfaceNdfType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SurfaceNdfType ``` |

| Visual C++ |
| --- |
| ``` public enum class SurfaceNdfType ``` |

# Members

| Member name | Description |
| --- | --- |
| Beckmann |  |
| Ggx |  |

# See Also

Autodesk.Revit.DB.Visual Namespace